app/controllers/components_controller.rb

	def find
		query = params[:query]
		@components = Component.where('title like ?', "%#{query}%")
---
SELECT `components`.* FROM `components` WHERE (title like '%{}%')